---
kind: type
id: T:Autodesk.Revit.DB.Architecture.StairsLandingType
source: html/f8f8ec06-3a1d-cb85-2c0b-cb5095c73a08.htm
---
# Autodesk.Revit.DB.Architecture.StairsLandingType

Represents a stairs landing type in Autodesk Revit.

## Syntax (C#)
```csharp
public class StairsLandingType : ElementType
```